Repository: AhmedBAKKARI/CPU-X
Catalog: po/*.po
Languages: th

source: could not reallocate memory
th: ไม่สามารถจัดสรรหน่วยความจำได้

source: Exiting %s
th: กำลังออก %s

source: Finding CPU technology
th: กำลังหาเทคโนโลยีของ CPU

source: Your CPU does not belong in database ==> %s, model: %i, ext. model: %i, ext. family: %i
th: CPU ของคุณไม่ได้อยู่ในฐานข้อมูล ==> %s, โมเดล: %i, ext. โมเดล: %i, ext. แฟมิลี่: %i

source: Calling libcpuid for retrieving static data
th: กำลังใช้ libcpuid เพื่อรับข้อมูล

source: failed to call libcpuid (%s)
th: ล้มเหลวในการใช้ libcpuid (%s)

source: Calling libcpuid for retrieving dynamic data
th: กำลังใช้ libcpuid เพื่อรับข้อมูล

source: Skip CPU MSR opening (need to be root)
th: ข้ามการเปิด CPU MSR (จำเป็นต้องรูท)

source: failed to open CPU MSR (%s)
th: ล้มเหลวในการเปิด CPU MSR (%s)

source: Calling libcpuid for retrieving CPU MSR static values
th: กำลังใช้ libcpuid เพื่อรับข้อมูล static ของ CPU MSR

source: Calling libcpuid for retrieving CPU MSR dynamic values
th: กำลังใช้ libcpuid เพื่อรับข้อมูล dynamic ของ CPU MSR

source: Calculating CPU multipliers
th: กำลังคำนวณ CPU multipliers

source: Skip call to dmidecode (need to be root)
th: ข้ามการเรียกใช้ dmidecode (จำเป็นต้องรูท)

source: Calling dmidecode
th: เรียกใช้ dmidecode

source: failed to allocate memory for dmidecode
th: ล้มเหลวในการจัดสรรหน่วยความจำของ dmidecode

source: failed to call dmidecode
th: ล้มเหลวในการเรียกใช้ dmidecode

source: Calculating CPU usage
th: กำลังคำนวณการใช้ CPU

source: Calling bandwidth
th: เรียกใช้ bandwidth

source: Finding graphic card driver
th: หาไดรเวอร์การ์ดจอ

source: Your GPU driver is unknown: %s
th: ไม่รู้จักไดรเวอร์การ์ดจอของคุณ: %s

source: (%s driver)
th: (%s ไดรเวอร์)

source: failed to find graphic card driver (%s)
th: ล้มเหลวในการหาไดรเวอร์การ์ดจอ

source: Finding devices
th: กำลังหาอุปกรณ์

source: Skip devices search (need to be root)
th: ข้ามการหาอุปกรณ์ (จำเป็นต้องรูท)

source: Your GPU vendor is unknown: %s (%#X)
th: ไม่รู้จักผู้จำหน่ายการ์ดจอของคุณ: %s (%#X)

source: failed to find chipset vendor and model
th: ล้มเหลวในการหายี่ห้อและรุ่นชิปเซ็ต

source: failed to find graphic card vendor and model
th: ล้มเหลวในการหายี่ห้อและรุ่นการ์ดจอ

source: Retrieving GPU temperature
th: รับข้อมูลอุณหภูมิการ์ดจอ

source: Off
th: ปิด

source: failed to retrieve GPU temperature
th: ล้มเหลวในการรับอุณหภูมิการ์ดจอ

source: Skip some GPU values (need to be root)
th: ข้ามค่าการ์ดจอบางค่า (จำเป็นต้องรูท)

source: Retrieving GPU clocks
th: รับค่าคล็อกการ์ดจอ

source: Driver for GPU %i doesn't report frequencies
th: ไดรเวอร์การ์ดจอ %i ไม่แสดงค่าความถี่

source: failed to retrieve GPU clocks
th: ล้มเหลวในการรับค่าคล็อกการ์ดจอ

source: Identifying running system
th: กำลังระบุระบบที่ทำงานอยู่

source: failed to identify running system
th: ล้มเหลวในการระบุระบบที่ทำงานอยู่

source: Calling libprocps
th: เรียกใช้ libprocps

source: Calling libstatgrab
th: เรียกใช้ libstatgrab

source: %i days, %i hours, %i minutes, %i seconds
th: %i วัน, %i ชั่วโมง, %i นาที, %i วินาที

source: Updating benchmark status
th: กำลังอัพเดตสถานะ benchmark

source: %u mins
th: %u นาที

source: Inactive
th: ไม่ใช้งาน

source: Not started
th: ยังไม่เริ่ม

source: Active
th: ตอบสนอง

source: (%u hours left)
th: (%u ชั่วโมงที่เหลือ)

source: (%u minutes left)
th: (%u นาทีที่เหลือ)

source: (%u seconds left)
th: (%u วินาทีที่เหลือ)

source: in %u hours
th: ใน %u ชั่วโมง

source: in %u minutes
th: ใน %u นาที

source: in %u seconds
th: ใน %u วินาที

source: Starting benchmark
th: ทดสอบสมรรถภาพ

source: failed to allocate memory for benchmark
th: ล้มเหลวในการจักสรรหน่วยความจำสำหรับทดสอบสมรรถภาพ

source: an error occurred while starting benchmark
th: เกิดข้อผิดพลาดขณะทดสอบสมรรถภาพ

source: Finding CPU package in fallback mode
th: กำลังหา CPU package ใน fallback mode

source: Your CPU socket does not belong in database ==> %s, codename: %s
th: CPU socket ของคุณไม่อยู่ในฐานข้อมูล ==> %s, codename: %s

source: Calculating CPU multipliers in fallback mode
th: กำลังคำนวณตัวคูณ CPU ใน fallback mode

source: Retrieving motherboard information in fallback mode
th: รับข้อมูลเมนบอร์ดในโหมด fallback

source: failed to retrieve motherboard information (fallback mode)
th: ล้มเหลวในการรับข้อมูลเมนบอร์ด (โหมด fallback)

source: Retrieving CPU temperature in fallback mode
th: รับค่าอุณหภูมิ CPU ในโหมด fallback

source: failed to retrieve CPU temperature (fallback mode)
th: ล้มเหลวในการรับค่าอุณหภูมิ CPU (โหมด fallback)

source: Retrieving CPU voltage in fallback mode
th: รับค่า CPU voltage ในโหมด fallback

source: failed to retrieve CPU voltage (fallback mode)
th: ล้มเหลวในการรับค่า CPU voltage (โหมด fallback)

source: Retrieving CPU frequency in fallback mode
th: รับค่าความถี่ CPU ในโหมด fallback

source: failed to retrieve CPU frequency (fallback mode)
th: ล้มเหลวในการรับค่าความถี่ CPU ในโหมด fallback

source: Starting GTK GUI...
th: เริ่มต้น GTK GUI...

source: failed to import UI in GtkBuilder
th: ล้มเหลวในการนำเข้า UI ใน GtkBuilder

source: Root privileges are required to work properly
th: จำเป็นต้องใช้สิทธในการรูธเพื่อให้สามารถทำงานได้อย่างราบรื่น

source: Some information will not be retrievable
th: ข้อมูลบางอย่างไม่สามารถรับค่าได้

source: Ignore
th: เพิกเฉย

source: Run as root
th: เริ่มแบบการรูท

source: A new version of %s is available!
th: มีเวอร์ชันใหม่ของ %s

source: Do you want to update %s to version %s after exit? It will erase this binary file (%s) by the new version.
th: ต้องการอัพเดท %s ไปยังเวอร์ชัน %s หลังจากออกหรือไม่? ข้อมูล binary file (%s) จะหายไปหลังจากเวอร์ชันใหม่

source: Not now
th: ไม่ใช่ตอนนี้

source: Update
th: อัพเดท

source: Setting label names
th: ตั้งค่า label names

source: Processor
th: หน่วยประมวลผล

source: Vendor
th: ยี่ห้อ (Vendor)

source: Package
th: แพ็กเกจ

source: Technology
th: เทคโนโลยี

source: Specification
th: สเปค

source: Model
th: โมเดล

source: Ext. Model
th: Ext. โมเดล

source: Temp.
th: อุณหภูมิ

source: Stepping
th: สเตป

source: Instructions
th: คำสั่ง

source: Clocks
th: คล็อก

source: Core Speed
th: ความเร็วคอร์

source: Multiplier
th: ตัวคูณ

source: Bus Speed
th: ความเร็วบัส

source: Usage
th: ใช้งาน

source: Cache
th: แคช

source: L1 Data
th: ข้อมูล L1

source: L1 Inst.
th: คำสั่ง L1

source: Level 2
th: เลเวล 2

source: Level 3
th: เลเวล 3

source: Socket(s)
th: ซ็อกเก็ต

source: Core(s)
th: คอร์

source: Thread(s)
th: เทรด

source: Caches
th: แคช

source: L%i Cache
th: L%i แคช

source: Size
th: ขนาด

source: Speed
th: ความเร็ว

source: Test
th: ทดสอบ

source: Motherboard
th: เมนบอร์ด

source: Manufacturer
th: ผู้ผลิต

source: Revision
th: การแก้ไข

source: BIOS
th: ไบออส

source: Brand
th: แบรนด์

source: Version
th: เวอร์ชัน

source: Date
th: วันที่

source: ROM Size
th: ขนาดรอม

source: Chipset
th: ชิปเซ็ต

source: Memory
th: หน่วยความจำ

source: Reference
th: อ้างอิง

source: System
th: ระบบ

source: Operating System
th: ระบบปฏิบัติการ

source: Kernel
th: เคอร์แนล

source: Hostname
th: ชื่อโฮสต์

source: Compiler
th: คอมไพล์เลอร์

source: Used
th: ใช้งาน

source: Buffers
th: บัฟเฟอร์

source: Cached
th: แคช

source: Free
th: ว่าง

source: Swap
th: สลับ

source: Graphics
th: กราฟฟิค

source: Card %i
th: การ์ด %i

source: Temperature
th: อุณหภูมิ

source: GPU clock
th: คล็อกการ์ดจอ

source: Memory clock
th: คล็อกหน่วยความจำ

source: Prime numbers (slow)
th: จำนวนเฉพาะ (ช้า)

source: Prime numbers (fast)
th: จำนวนเฉพาะ (เร็ว)

source: Score
th: คะแนน

source: Run
th: เริ่ม

source: Parameters
th: พารามิเตอร์

source: Duration
th: ระยะเวลา

source: Threads
th: เธรด

source: About
th: เกี่ยวกับ

source: %s is a Free software that gathers information on CPU, motherboard and more.
th: %s เป็นซอร์ฟแวร์ฟรีที่อ่านข้อมูลของCPU, เมนบอร์ด และอีกมากมาย

source: Version %s
th: เวอร์ชัน %s

source: Author: %s
th: ผู้สร้าง: %s

source: Site: %s
th: ไซต์: %s

source: License
th: ใบอนุญาต

source: This software is distributed under the terms of %s
th: ซอร์แวร์นี้เผยแพร่ภายใต้ข้อกำหนดของ %s

source: This program comes with ABSOLUTELY NO WARRANTY
th: โปรแกรมนี้ไม่มีรับประกันใดๆทั้งสิ้น

source: Freeing memory
th: ปลดปล่อยหน่วยความจำ

source: Checking on Internet for a new version...
th: ตรวจสอบหาเวอร์ชันใหม่

source: failed to open a Curl session
th: ล้มเหลวในการเปิด Curl session

source: failed to perform the Curl transfer (%s)
th: ล้มเหลวในการ Curl transfer (%s)

source: wrong write data
th: ข้อมูลการเขียนผิดพลาด

source: (version %s is available)
th: (เวอร์ชัน %s พร้อมแล้ว)

source: No new version available
th: ไม่มีเวอร์ชันใหม่

source: (up-to-date)
th: (เวอร์ชันล่าสุด)

source: an error occurred while extracting %s archive (%s)
th: เกิดข้อผิดพลาดขณะแยก %s

source: Network access is disabled by environment variable (set CPUX_NETWORK with a positive value to enable it)
th: การเชื่อมต่อเน็ตเวิร์กถูกปิดโดย environment variable (ตั้ง CPUX_NETWORK ด้วยค่าบวกเพื่อเปิดการทำงาน)

source: failed to open %s archive for writing
th: ล้มเหลวในการเปิด %s เพื่อเขียน

source: Downloading new version...
th: ดาวโหลดเวอร์ชันใหม่

source: failed to download %s archive (%s)
th: ล้มเหลวในการดาวโหลด %s

source: Extracting new version...
th: กำลังแยกไฟล์เวอร์ชันใหม่

source: Applying new version...
th: กำลังรับเวอร์ชันใหม่

source: an error occurred while removing/renaming files
th: เกิดข้อผิดพลาดขณะลบ/เปลี่ยนชื่อไฟล์

source: Update successful!
th: อัพเดทสำเร็จ

source: Start graphical user interface (GUI) (default)
th: เริ่มต้น GUI (ค่าเริ่มต้น)

source: Start text-based user interface (TUI)
th: เริ่มต้น text-based user interface (TUI)

source: Dump all data on standard output and exit
th: ลบข้อมูลทั้งหมดและออก

source: Run embedded command dmidecode and exit
th: เริ่ม embedded command dmidecode และออก

source: Run embedded command bandwidth and exit
th: เริ่ม embedded command bandwidth และออก

source: Set default tab (integer)
th: ตั่งค่าแท็บเริ่มต้น (จำนวนเต็ม)

source: Select CPU core to monitor (integer)
th: เลือกคอร์ CPU เพื่อติดตาม (จำนวนเต็ม)

source: Set custom bandwidth test for CPU caches speed (integer)
th: ตั้งการทดสอบ bandwidth สำหรับความเร็วแคช CPU (จำนวนเต็ม)

source: Set custom time between two refreshes (in seconds)
th: ตั้งเวลาระหว่างสอง refreshes (วินาที)

source: Disable colored output
th: ปิดเอาท์พุตสี

source: Print required information to paste in an issue
th: พิมพ์ข้อมูลที่จำเป็นและวางในช่องปัญหา

source: Verbose output
th: เอาท์พุตละเอียด

source: Update portable version if a new version is available
th: อัพเดตเวอร์ชันพกพาถ้ามีเวอร์ชันใหม่

source: Print help and exit
th: พิมพ์ข้อช่วยเหลือและออก

source: Print version and exit
th: พิมพ์เวอร์ชันและออก

source: Temporarily disable network support
th: ปิดตัวสนับสนุนด้านเน็ตเวิร์กชั่วคราว

source: Enforce the bus clock
th: บังคับคล็อกของบัส

source: Read CPUID raw data from a given file
th: อ่านข้อมูลดิบ CPUID จากไฟล์ที่ให้มา

source: Only print a message if CPU does not belong in database
th: พิมพ์ข้อความเท่านั้นถ้า CPU ไม่มีในฐานข้อมูล

source: Usage: %s DISPLAY [OPTIONS]
th: ใช้งาน: %s แสดงผล [ตัวเลือก]

source: Available DISPLAY:
th: การแสดงผลที่ใช้ได้

source: Available OPTIONS:
th: การตั้งค่าที่ใช้ได้

source: Influenceable environment variables:
th: environment variables ที่มีอิทธิพล:

source: This is free software: you are free to change and redistribute it.
th: นี่คือซอร์ฟแวร์ฟรี: คุณสามารถที่จะแก้ไขและแจกจ่ายได้

source: See the %s license: <%s>
th: ดูใบอนุญาต %s

source: Built on %s, %s (with %s %s on %s).
th: สร้างบน %s , %s (with %s %s on %s).

source: -- %-9s version: %s
th: -- %-9s เวอร์ชัน: %s

source: %sOops, something was wrong! %s has received signal %d (%s) and has crashed.%s
th: %โอ้ว, มีบางอย่างผิดพลาด! %s กำลังรับสัญญาณ %d (%s) และเกิดข้อผิดพลาด.%s

source: You can paste this backtrace by opening a new issue here:
th: คุณสามารถวาง backtrace โดยการเปิด issue ใหม่

source: an error occurred while setting locale
th: เกิดข้อผิดพลาดขณะตั้งค่า locale

source: Sorry, you cannot update %s: 32-bit portable version is no more supported.
th: โทษที, คุณไม่สามารถอัพเดต %s:เวอร์ชันพกพา 32-bit ไม่รองรับอีกต่อไป

source: Starting NCurses TUI...
th: เริ่ม NCurses TUI...

source: Press 'h' to see help.
th: กด 'h' เพื่อดูตัวช่วย

source: Welcome in %s NCurses help!
th: ยินดีต้องรับใน %s NCurses!

source: This help describes how to use this Text-based User Interface.
th: ตัวช่วยนี้อธิบายถึงวิธีการใช้ Text-based User Interface

source: Press 'left' key to switch in left tab.
th: กดปุ่ม 'ซ้าย'เพื่อสลับไปในแท๊บซ้าย

source: Press 'right' key to switch in right tab.
th: กดปุ่ม 'ขวา'เพื่อสลับไปในแท๊บขวา

source: Press 'h' key to see this help.
th: กดปุ่ม 'h' เพื่อดูตัวช่วย

source: Press 'q' key to exit.
th: กด 'q' เพื่อออก

source: Press 'down' key to decrease core number to monitor.
th: กดปุ่ม 'ลง' เพื่อลดจำนวนคอร์ที่จะสังเกตการณ์

source: Press 'up' key to increase core number to monitor.
th: กด 'ขึ้น' เพื่อเพิ่มจำนวนคอร์ที่จะสังเกตการณ์

source: Press 'down' key to switch to previous test.
th: กดปุ่ม 'ลง' เพื่อสลับไปยังการทดสอบก่อนหน้า

source: Press 'up' key' to switch to next test.
th: กดปุ่ม 'ขึ้น' เพื่อสลับไปยังการทดสอบถัดไป

source: Press 'down' key to decrement benchmark duration.
th: กดปุ่ม 'ลง' เพื่อลดระยะเวลาการทดสอบสมรรถภาพ

source: Press 'up' key to increment benchmark duration.
th: กดปุ่ม 'ขึ้น' เพื่อเพิ่มระยะเวลาการทดสอบสมรรถภาพ

source: Press 'next page' key to decrement number of threads to use.
th: กดปุ่ม 'next page' เพื่อลดจำนวนของเธรดที่ใช้

source: Press 'previous page' key to increment number of threads to use.
th: กดปุ่ม 'previous page' เพื่อเพิ่มจำนวนของเธรดที่ใช้

source: Press 's' key to start/stop prime numbers (slow) benchmark.
th: กดปุ่ม 's' เพื่อเริ่ม/หยุด การทดสอบสมรรถภาพจำนวนเฉพาะ(ช้า)

source: Press 'f' key to start/stop prime numbers (fast) benchmark.
th: กดปุ่ม 'f' เพื่อเริ่ม/หยุด การทดสอบสมรรถภาพจำนวนเฉพาะ(เร็ว)

source: Press any key to exit this help.
th: กดปุ่มใดก็ได้เพื่อออกจากตัวช่วย

source: If you want to update, press 'u' key, or anything else to skip.
th: ถ้าคุณต้องการอัพเดต,กดปุ่ม 'u' ,หรือกดปุ่มอะไรก็ได้เพื่อข้าม

source: %s will be updated.
th: %s กำลังจะอัพเดต

source: an error occurred while opening file '%s' (%s)
th: เกิดข้อผืดพลาดขณะเปิดไฟล์ '%s' (%s)

source: an error occurred while running command '%s' (%s)
th: เกิดข้อผิดพลาดขณะเริ่มทำงาน command '%s' (%s)

source: failed to open %s directory
th: ผิดพลาดในการเปิดไดเรคตอรี่ %s

source: an error occurred while compiling regex
th: เกิดข้อผิดพลาดขณะคอมไพล์ regex
